# Словник для перетворення букв в азбуку Морзе
morse = {
    'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 
    'G': '--.', 'H': '....', 'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 
    'M': '--', 'N': '-.', 'O': '---', 'P': '.--.', 'Q': '--.-', 'R': '.-.', 
    'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-', 
    'Y': '-.--', 'Z': '--..'
}

# Зчитуємо букву від користувача
letter = input("Enter a letter: ").upper()

# Виведення символа азбуки Морзе
if letter in morse:
    print(f"The Morse code for '{letter}' is {morse[letter]}.")
else:
    print("Invalid letter.")
